# Notebook to self increment its dataset using .env file

### first, we read our dataset

In [1]:
import pandas as pd

df = pd.read_csv("dataset.csv")

df

          name  age
0        felps   20
1         alex   22
2        bruno   24
3      ricardo   34
4        mario   88
5  olokinhomeu   44

### then, we read our new_entry

In [2]:
import os
from dotenv import load_dotenv

load_dotenv()

NAME = os.getenv('NAME')
AGE = os.getenv('AGE')

print(NAME, AGE)

a 1

### after that, we add our new_entry to our dataset

In [3]:
new_entry = {'name': [NAME], 'age': [AGE]}

new_entry = pd.DataFrame(new_entry)

df = pd.concat([df, new_entry], ignore_index=True)

df.to_csv('dataset.csv', index=False)

In [4]:
df

          name age
0        felps  20
1         alex  22
2        bruno  24
3      ricardo  34
4        mario  88
5  olokinhomeu  44
6            a   1

### Now, we can do whatever we want with our dataset. Like do some analyses

In [7]:
df['age'] = df['age'].astype('int')

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    7 non-null      object
 1   age     7 non-null      int32
dtypes: int32(1), object(1)
memory usage: 216.0+ bytes

In [9]:
df.describe()

             age
count   7.000000
mean   33.285714
std    27.511902
min     1.000000
25%    21.000000
50%    24.000000
75%    39.000000
max    88.000000